uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/internal/src/rcc.c
/**
 * @file rcc.c
 * @brief Internal STM32H7A3 reset and clock-control implementation.
 */

#include "rcc.h"

#include "stm32h7a3xxq.h"
#include "system_stm32h7xx.h"

#include <stddef.h>
#include <stdint.h>

/*
 * SPI2 is required by this target. The STM32H7A3 CMSIS header exposes the
 * SPI1/2/3 kernel-clock selector through CDCCIP1R.
 */
#if !defined(RCC_CDCCIP1R_SPI123SEL_Msk) || \
    !defined(RCC_CDCCIP1R_SPI123SEL_Pos)
#error "STM32H7A3 CMSIS header does not provide CDCCIP1R SPI123SEL."
#endif

/* -------------------------------------------------------------------------- */
/* Clock configuration                                                        */
/* -------------------------------------------------------------------------- */

/*
 * External and internal oscillator frequencies.
 */
#define RCC_HSE_FREQUENCY_HZ       8000000UL
#define RCC_HSI_FREQUENCY_HZ       64000000UL
#define RCC_CSI_FREQUENCY_HZ       4000000UL
#define RCC_HSI48_FREQUENCY_HZ     48000000UL

/*
 * Set to 1 when HSE is supplied by an external clock source rather than a
 * crystal or resonator.
 */
#define RCC_HSE_BYPASS_ENABLE      0U

/*
 * Maximum register polling iterations.
 */
#define RCC_TIMEOUT_ITERATIONS     1000000UL

/*
 * PLL1:
 *
 * HSE / 1 × 70 = 560 MHz VCO
 *
 * P = 280 MHz system clock
 * Q = 140 MHz peripheral clock
 * R = 280 MHz
 */
#define RCC_PLL1_M                 1U
#define RCC_PLL1_N                 70U
#define RCC_PLL1_P                 2U
#define RCC_PLL1_Q                 4U
#define RCC_PLL1_R                 2U
#define RCC_PLL1_FRACN             0U

/*
 * PLL2:
 *
 * HSE / 8 × 129 = 129 MHz VCO
 *
 * P = 16.125 MHz ADC clock
 *
 * This keeps the PLL2 reference input at 1 MHz and the VCO within the
 * permitted wide-range operating region.
 */
#define RCC_PLL2_M                 8U
#define RCC_PLL2_N                 129U
#define RCC_PLL2_P                 8U
#define RCC_PLL2_Q                 2U
#define RCC_PLL2_R                 2U
#define RCC_PLL2_FRACN             0U

/*
 * PLL3:
 *
 * HSE / 1 × 20 = 160 MHz VCO
 *
 * R = approximately 26.667 MHz LTDC pixel clock
 */
#define RCC_PLL3_M                 1U
#define RCC_PLL3_N                 20U
#define RCC_PLL3_P                 2U
#define RCC_PLL3_Q                 2U
#define RCC_PLL3_R                 6U
#define RCC_PLL3_FRACN             0U

/*
 * Bus frequencies.
 */
#define RCC_SYSTEM_CLOCK_HZ        280000000UL
#define RCC_CPU_CLOCK_HZ           280000000UL
#define RCC_AHB_CLOCK_HZ           280000000UL
#define RCC_APB1_CLOCK_HZ          140000000UL
#define RCC_APB2_CLOCK_HZ          140000000UL
#define RCC_APB3_CLOCK_HZ          140000000UL
#define RCC_APB4_CLOCK_HZ          140000000UL

/*
 * Peripheral kernel frequencies.
 */
#define RCC_SPI123_CLOCK_HZ        140000000UL
#define RCC_SPI45_CLOCK_HZ         140000000UL
#define RCC_SPI6_CLOCK_HZ          140000000UL

#define RCC_I2C123_CLOCK_HZ        140000000UL
#define RCC_I2C4_CLOCK_HZ          140000000UL

#define RCC_USART16910_CLOCK_HZ    140000000UL
#define RCC_USART234578_CLOCK_HZ   140000000UL
#define RCC_LPUART1_CLOCK_HZ       140000000UL

#define RCC_ADC_CLOCK_HZ           16125000UL
#define RCC_LTDC_CLOCK_HZ          26666667UL
#define RCC_USB_CLOCK_HZ           48000000UL

/*
 * Bus prescalers.
 */
#define RCC_CPU_DIVIDER            1U
#define RCC_AHB_DIVIDER            1U
#define RCC_APB1_DIVIDER           2U
#define RCC_APB2_DIVIDER           2U
#define RCC_APB3_DIVIDER           2U
#define RCC_APB4_DIVIDER           2U

/*
 * Peripheral clock-source selections.
 */
#define RCC_SPI123_SOURCE_PLL1_Q   0U
#define RCC_SPI45_SOURCE_PCLK2     0U
#define RCC_SPI6_SOURCE_PCLK4      0U

#define RCC_I2C123_SOURCE_PCLK1    0U
#define RCC_I2C4_SOURCE_PCLK4      0U

#define RCC_ADC_SOURCE_PLL2_P      0U
#define RCC_LTDC_SOURCE_PLL3_R     0U
#define RCC_USB_SOURCE_HSI48       2U

/*
 * Flash wait states required at 280 MHz.
 */
#define RCC_FLASH_LATENCY          6U

/* -------------------------------------------------------------------------- */
/* Private function declarations                                              */
/* -------------------------------------------------------------------------- */

static RCC_Result RCC_WaitForSet(volatile uint32_t *reg, uint32_t mask);
static RCC_Result RCC_WaitForClear(volatile uint32_t *reg, uint32_t mask);
static RCC_Result RCC_WaitForValue(volatile uint32_t *reg, uint32_t mask, uint32_t value);
static RCC_Result RCC_ConfigurePower(void);
static RCC_Result RCC_ConfigureFlash(void);
static RCC_Result RCC_EnableOscillators(void);
static RCC_Result RCC_ConfigurePLL1(void);
static RCC_Result RCC_ConfigurePLL2(void);
static RCC_Result RCC_ConfigurePLL3(void);
static RCC_Result RCC_ConfigureBusDividers(void);
static RCC_Result RCC_ConfigurePeripheralClocks(void);
static RCC_Result RCC_SwitchSystemClock(void);
static uint32_t RCC_EncodeAHBPrescaler(uint32_t divider);
static uint32_t RCC_EncodeAPBPrescaler(uint32_t divider);
static uint32_t RCC_EncodePLLInputRange(uint32_t frequency_hz);
static void RCC_WriteField(volatile uint32_t *reg, uint32_t mask, uint32_t position, uint32_t value);

/* -------------------------------------------------------------------------- */
/* Private functions                                                          */
/* -------------------------------------------------------------------------- */

static void RCC_WriteField(volatile uint32_t *reg, uint32_t mask, uint32_t position, uint32_t value)
{
    *reg = (*reg & ~mask) | ((value << position) & mask);
}

static RCC_Result RCC_WaitForSet(volatile uint32_t *reg, uint32_t mask)
{
    uint32_t timeout = RCC_TIMEOUT_ITERATIONS;

    while (((*reg & mask) == 0U) && (timeout > 0U))
    {
        timeout--;
    }

    return (timeout > 0U) ? RCC_RESULT_OK : RCC_RESULT_TIMEOUT;
}

static RCC_Result RCC_WaitForClear(volatile uint32_t *reg, uint32_t mask)
{
    uint32_t timeout = RCC_TIMEOUT_ITERATIONS;

    while (((*reg & mask) != 0U) && (timeout > 0U))
    {
        timeout--;
    }

    return (timeout > 0U) ? RCC_RESULT_OK : RCC_RESULT_TIMEOUT;
}

