uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/internal/src/rcc.c
static RCC_Result RCC_WaitForValue(volatile uint32_t *reg, uint32_t mask, uint32_t value)
{
    uint32_t timeout = RCC_TIMEOUT_ITERATIONS;

    while (((*reg & mask) != value) && (timeout > 0U))
    {
        timeout--;
    }

    return (timeout > 0U) ? RCC_RESULT_OK : RCC_RESULT_TIMEOUT;
}

static uint32_t RCC_EncodeAHBPrescaler(uint32_t divider)
{
    switch (divider)
    {
        case 1U:
            return 0x0U;

        case 2U:
            return 0x8U;

        case 4U:
            return 0x9U;

        case 8U:
            return 0xAU;

        case 16U:
            return 0xBU;

        case 64U:
            return 0xCU;

        case 128U:
            return 0xDU;

        case 256U:
            return 0xEU;

        case 512U:
            return 0xFU;

        default:
            return 0x0U;
    }
}

static uint32_t RCC_EncodeAPBPrescaler(uint32_t divider)
{
    switch (divider)
    {
        case 1U:
            return 0x0U;

        case 2U:
            return 0x4U;

        case 4U:
            return 0x5U;

        case 8U:
            return 0x6U;

        case 16U:
            return 0x7U;

        default:
            return 0x0U;
    }
}

static uint32_t RCC_EncodePLLInputRange(uint32_t frequency_hz)
{
    if (frequency_hz < 2000000UL)
    {
        return 0U;
    }

    if (frequency_hz < 4000000UL)
    {
        return 1U;
    }

    if (frequency_hz < 8000000UL)
    {
        return 2U;
    }

    return 3U;
}

static RCC_Result RCC_ConfigurePower(void)
{
    RCC_Result result;

    RCC->APB4ENR |= RCC_APB4ENR_SYSCFGEN;
    (void)RCC->APB4ENR;

    /*
     * Select the internal LDO supply.
     */
    PWR->CR3 &= ~PWR_CR3_SMPSEN;
    PWR->CR3 |= PWR_CR3_LDOEN;

    /*
     * VOS0 is required for the 280 MHz system clock.
     */
    PWR->SRDCR &= ~PWR_SRDCR_VOS_Msk;
    PWR->SRDCR |= 3UL << PWR_SRDCR_VOS_Pos;

    result = RCC_WaitForSet(&PWR->SRDCR, PWR_SRDCR_VOSRDY);

    return result;
}

static RCC_Result RCC_ConfigureFlash(void)
{
    uint32_t expected_latency;

    expected_latency = (RCC_FLASH_LATENCY << FLASH_ACR_LATENCY_Pos) & FLASH_ACR_LATENCY_Msk;

    RCC_WriteField(&FLASH->ACR, FLASH_ACR_LATENCY_Msk, FLASH_ACR_LATENCY_Pos, RCC_FLASH_LATENCY);

    return RCC_WaitForValue(&FLASH->ACR, FLASH_ACR_LATENCY_Msk, expected_latency);
}

static RCC_Result RCC_EnableOscillators(void)
{
    RCC_Result result;

#if RCC_HSE_BYPASS_ENABLE
    RCC->CR |= RCC_CR_HSEBYP;

#ifdef RCC_CR_HSEEXT
    RCC->CR |= RCC_CR_HSEEXT;
#endif

#else
    RCC->CR &= ~RCC_CR_HSEBYP;
#endif

    RCC->CR |= RCC_CR_HSEON;

    result = RCC_WaitForSet(&RCC->CR, RCC_CR_HSERDY);

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    RCC->CR |= RCC_CR_HSI48ON;

    result = RCC_WaitForSet(&RCC->CR, RCC_CR_HSI48RDY);

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    RCC->CSR |= RCC_CSR_LSION;

    return RCC_WaitForSet(&RCC->CSR, RCC_CSR_LSIRDY);
}

static RCC_Result RCC_ConfigurePLL1(void)
{
    RCC_Result result;

    RCC->CR &= ~RCC_CR_PLL1ON;

    result = RCC_WaitForClear(&RCC->CR, RCC_CR_PLL1RDY);

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    RCC_WriteField(&RCC->PLLCKSELR, RCC_PLLCKSELR_PLLSRC_Msk, RCC_PLLCKSELR_PLLSRC_Pos, 2U);
    RCC_WriteField(&RCC->PLLCKSELR, RCC_PLLCKSELR_DIVM1_Msk, RCC_PLLCKSELR_DIVM1_Pos, RCC_PLL1_M);
    RCC_WriteField(&RCC->PLLCFGR, RCC_PLLCFGR_PLL1RGE_Msk, RCC_PLLCFGR_PLL1RGE_Pos, RCC_EncodePLLInputRange(RCC_HSE_FREQUENCY_HZ / RCC_PLL1_M));

    /*
     * Select the wide VCO range.
     */
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL1VCOSEL;

    RCC->PLLCFGR |= RCC_PLLCFGR_DIVP1EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVQ1EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVR1EN;
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL1FRACEN;

    RCC->PLL1DIVR =
        ((RCC_PLL1_N - 1U) << RCC_PLL1DIVR_N1_Pos) |
        ((RCC_PLL1_P - 1U) << RCC_PLL1DIVR_P1_Pos) |
        ((RCC_PLL1_Q - 1U) << RCC_PLL1DIVR_Q1_Pos) |
        ((RCC_PLL1_R - 1U) << RCC_PLL1DIVR_R1_Pos);

    RCC->PLL1FRACR = RCC_PLL1_FRACN << RCC_PLL1FRACR_FRACN1_Pos;

    RCC->CR |= RCC_CR_PLL1ON;

    return RCC_WaitForSet(&RCC->CR, RCC_CR_PLL1RDY);
}

static RCC_Result RCC_ConfigurePLL2(void)
{
    RCC_Result result;

    RCC->CR &= ~RCC_CR_PLL2ON;

    result = RCC_WaitForClear(&RCC->CR, RCC_CR_PLL2RDY);

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    RCC_WriteField(&RCC->PLLCKSELR, RCC_PLLCKSELR_DIVM2_Msk, RCC_PLLCKSELR_DIVM2_Pos, RCC_PLL2_M);
    RCC_WriteField(&RCC->PLLCFGR, RCC_PLLCFGR_PLL2RGE_Msk, RCC_PLLCFGR_PLL2RGE_Pos, RCC_EncodePLLInputRange(RCC_HSE_FREQUENCY_HZ / RCC_PLL2_M));

    /*
     * Select the wide VCO range.
     */
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL2VCOSEL;

    RCC->PLLCFGR |= RCC_PLLCFGR_DIVP2EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVQ2EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVR2EN;
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL2FRACEN;

    RCC->PLL2DIVR =
        ((RCC_PLL2_N - 1U) << RCC_PLL2DIVR_N2_Pos) |
        ((RCC_PLL2_P - 1U) << RCC_PLL2DIVR_P2_Pos) |
        ((RCC_PLL2_Q - 1U) << RCC_PLL2DIVR_Q2_Pos) |
        ((RCC_PLL2_R - 1U) << RCC_PLL2DIVR_R2_Pos);

    RCC->PLL2FRACR = RCC_PLL2_FRACN << RCC_PLL2FRACR_FRACN2_Pos;

    RCC->CR |= RCC_CR_PLL2ON;

    return RCC_WaitForSet(&RCC->CR, RCC_CR_PLL2RDY);
}

static RCC_Result RCC_ConfigurePLL3(void)
{
    RCC_Result result;

    RCC->CR &= ~RCC_CR_PLL3ON;

    result = RCC_WaitForClear(&RCC->CR, RCC_CR_PLL3RDY);

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    RCC_WriteField(&RCC->PLLCKSELR, RCC_PLLCKSELR_DIVM3_Msk, RCC_PLLCKSELR_DIVM3_Pos, RCC_PLL3_M);
    RCC_WriteField(&RCC->PLLCFGR, RCC_PLLCFGR_PLL3RGE_Msk, RCC_PLLCFGR_PLL3RGE_Pos, RCC_EncodePLLInputRange(RCC_HSE_FREQUENCY_HZ / RCC_PLL3_M));

    /*
     * Select the wide VCO range.
     */
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL3VCOSEL;

    RCC->PLLCFGR |= RCC_PLLCFGR_DIVP3EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVQ3EN;
    RCC->PLLCFGR |= RCC_PLLCFGR_DIVR3EN;
    RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL3FRACEN;

