uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/internal/src/rcc.c
    RCC->PLL3DIVR =
        ((RCC_PLL3_N - 1U) << RCC_PLL3DIVR_N3_Pos) |
        ((RCC_PLL3_P - 1U) << RCC_PLL3DIVR_P3_Pos) |
        ((RCC_PLL3_Q - 1U) << RCC_PLL3DIVR_Q3_Pos) |
        ((RCC_PLL3_R - 1U) << RCC_PLL3DIVR_R3_Pos);

    RCC->PLL3FRACR = RCC_PLL3_FRACN << RCC_PLL3FRACR_FRACN3_Pos;

    RCC->CR |= RCC_CR_PLL3ON;

    return RCC_WaitForSet(&RCC->CR, RCC_CR_PLL3RDY);
}

static RCC_Result RCC_ConfigureBusDividers(void)
{
    RCC_WriteField(&RCC->CDCFGR1, RCC_CDCFGR1_CDCPRE_Msk, RCC_CDCFGR1_CDCPRE_Pos, RCC_EncodeAHBPrescaler(RCC_CPU_DIVIDER));
    RCC_WriteField(&RCC->CDCFGR1, RCC_CDCFGR1_HPRE_Msk, RCC_CDCFGR1_HPRE_Pos, RCC_EncodeAHBPrescaler(RCC_AHB_DIVIDER));
    RCC_WriteField(&RCC->CDCFGR1, RCC_CDCFGR1_CDPPRE_Msk, RCC_CDCFGR1_CDPPRE_Pos, RCC_EncodeAPBPrescaler(RCC_APB3_DIVIDER));
    RCC_WriteField(&RCC->CDCFGR2, RCC_CDCFGR2_CDPPRE1_Msk, RCC_CDCFGR2_CDPPRE1_Pos, RCC_EncodeAPBPrescaler(RCC_APB1_DIVIDER));
    RCC_WriteField(&RCC->CDCFGR2, RCC_CDCFGR2_CDPPRE2_Msk, RCC_CDCFGR2_CDPPRE2_Pos, RCC_EncodeAPBPrescaler(RCC_APB2_DIVIDER));
    RCC_WriteField(&RCC->SRDCFGR, RCC_SRDCFGR_SRDPPRE_Msk, RCC_SRDCFGR_SRDPPRE_Pos, RCC_EncodeAPBPrescaler(RCC_APB4_DIVIDER));

    return RCC_RESULT_OK;
}

static RCC_Result RCC_ConfigurePeripheralClocks(void)
{
    /*
     * SPI1/2/3 use PLL1-Q. SPI2 is required by this target, so this
     * configuration is mandatory.
     */
    RCC_WriteField(
        &RCC->CDCCIP1R,
        RCC_CDCCIP1R_SPI123SEL_Msk,
        RCC_CDCCIP1R_SPI123SEL_Pos,
        RCC_SPI123_SOURCE_PLL1_Q);

    if ((RCC->CDCCIP1R & RCC_CDCCIP1R_SPI123SEL_Msk) !=
        ((RCC_SPI123_SOURCE_PLL1_Q << RCC_CDCCIP1R_SPI123SEL_Pos) &
         RCC_CDCCIP1R_SPI123SEL_Msk))
    {
        return RCC_RESULT_CLOCK_FAILURE;
    }

#ifdef RCC_D2CCIP1R_SPI45SEL_Msk
    RCC_WriteField(&RCC->D2CCIP1R, RCC_D2CCIP1R_SPI45SEL_Msk, RCC_D2CCIP1R_SPI45SEL_Pos, RCC_SPI45_SOURCE_PCLK2);
#endif

#ifdef RCC_D3CCIPR_SPI6SEL_Msk
    RCC_WriteField(&RCC->D3CCIPR, RCC_D3CCIPR_SPI6SEL_Msk, RCC_D3CCIPR_SPI6SEL_Pos, RCC_SPI6_SOURCE_PCLK4);
#endif

#ifdef RCC_D2CCIP2R_I2C123SEL_Msk
    RCC_WriteField(&RCC->D2CCIP2R, RCC_D2CCIP2R_I2C123SEL_Msk, RCC_D2CCIP2R_I2C123SEL_Pos, RCC_I2C123_SOURCE_PCLK1);
#endif

#ifdef RCC_D3CCIPR_I2C4SEL_Msk
    RCC_WriteField(&RCC->D3CCIPR, RCC_D3CCIPR_I2C4SEL_Msk, RCC_D3CCIPR_I2C4SEL_Pos, RCC_I2C4_SOURCE_PCLK4);
#endif

#ifdef RCC_D3CCIPR_ADCSEL_Msk
    RCC_WriteField(&RCC->D3CCIPR, RCC_D3CCIPR_ADCSEL_Msk, RCC_D3CCIPR_ADCSEL_Pos, RCC_ADC_SOURCE_PLL2_P);
#endif

#ifdef RCC_D1CCIPR_LTDCSEL_Msk
    RCC_WriteField(&RCC->D1CCIPR, RCC_D1CCIPR_LTDCSEL_Msk, RCC_D1CCIPR_LTDCSEL_Pos, RCC_LTDC_SOURCE_PLL3_R);
#endif

#ifdef RCC_D2CCIP2R_USBSEL_Msk
    RCC_WriteField(&RCC->D2CCIP2R, RCC_D2CCIP2R_USBSEL_Msk, RCC_D2CCIP2R_USBSEL_Pos, RCC_USB_SOURCE_HSI48);
#endif

    return RCC_RESULT_OK;
}

static RCC_Result RCC_SwitchSystemClock(void)
{
    RCC_WriteField(&RCC->CFGR, RCC_CFGR_SW_Msk, RCC_CFGR_SW_Pos, 3U);

    return RCC_WaitForValue(&RCC->CFGR, RCC_CFGR_SWS_Msk, 3U << RCC_CFGR_SWS_Pos);
}

/* -------------------------------------------------------------------------- */
/* Public functions                                                           */
/* -------------------------------------------------------------------------- */

RCC_Result RCC_Init(void)
{
    RCC_Result result;

    /*
     * Enable all peripheral kernel-clock gates. Individual peripheral bus
     * clocks remain controlled by RCC_EnablePeripheralClock().
     */
    RCC->CKGAENR = 0xFFFFFFFFUL;
    (void)RCC->CKGAENR;

    result = RCC_ConfigurePower();

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    result = RCC_ConfigureFlash();

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    result = RCC_EnableOscillators();

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    result = RCC_ConfigurePLL1();

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    result = RCC_ConfigurePLL2();

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    result = RCC_ConfigurePLL3();

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    result = RCC_ConfigureBusDividers();

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    result = RCC_ConfigurePeripheralClocks();

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    result = RCC_SwitchSystemClock();

    if (result != RCC_RESULT_OK)
    {
        return result;
    }

    SystemCoreClock = RCC_CPU_CLOCK_HZ;

    return RCC_RESULT_OK;
}

uint32_t RCC_GetKernelFrequency(const void *peripheral)
{
    if (peripheral == NULL)
    {
        return 0U;
    }

    /*
     * SPI.
     */
    if ((peripheral == SPI1) || (peripheral == SPI2) || (peripheral == SPI3))
    {
        return RCC_SPI123_CLOCK_HZ;
    }

    if ((peripheral == SPI4) || (peripheral == SPI5))
    {
        return RCC_SPI45_CLOCK_HZ;
    }

#ifdef SPI6
    if (peripheral == SPI6)
    {
        return RCC_SPI6_CLOCK_HZ;
    }
#endif

    /*
     * I2C.
     */
    if ((peripheral == I2C1) || (peripheral == I2C2) || (peripheral == I2C3))
    {
        return RCC_I2C123_CLOCK_HZ;
    }

#ifdef I2C4
    if (peripheral == I2C4)
    {
        return RCC_I2C4_CLOCK_HZ;
    }
#endif

    /*
     * Timers on APB1.
     *
     * Timer clocks run at twice PCLK when the APB prescaler is greater than
     * one.
     */
    if ((peripheral == TIM2) || (peripheral == TIM3) || (peripheral == TIM4) || (peripheral == TIM5) ||
        (peripheral == TIM6) || (peripheral == TIM7) || (peripheral == TIM12) || (peripheral == TIM13) ||
        (peripheral == TIM14))
    {
        return RCC_APB1_CLOCK_HZ * 2U;
    }

    /*
     * Timers on APB2.
     */
    if ((peripheral == TIM1) || (peripheral == TIM8) || (peripheral == TIM15) ||
        (peripheral == TIM16) || (peripheral == TIM17))
    {
        return RCC_APB2_CLOCK_HZ * 2U;
    }

    /*
     * USART and UART.
     */
    if ((peripheral == USART1) || (peripheral == USART6))
    {
        return RCC_USART16910_CLOCK_HZ;
    }

