uSolder/DualSlide/Software/firmware/embedded/board/dspcbr1/target/stm32h7a3/internal/src/rcc.c
    if ((peripheral == USART2) || (peripheral == USART3) || (peripheral == UART4) ||
        (peripheral == UART5) || (peripheral == UART7) || (peripheral == UART8))
    {
        return RCC_USART234578_CLOCK_HZ;
    }

#ifdef LPUART1
    if (peripheral == LPUART1)
    {
        return RCC_LPUART1_CLOCK_HZ;
    }
#endif

    /*
     * GPIO.
     */
    if ((peripheral == GPIOA) || (peripheral == GPIOB) || (peripheral == GPIOC) ||
        (peripheral == GPIOD) || (peripheral == GPIOE) || (peripheral == GPIOF) ||
        (peripheral == GPIOG) || (peripheral == GPIOH) || (peripheral == GPIOI) ||
        (peripheral == GPIOJ) || (peripheral == GPIOK))
    {
        return RCC_AHB_CLOCK_HZ;
    }

#ifdef ADC1
    if ((peripheral == ADC1) || (peripheral == ADC2))
    {
        return RCC_ADC_CLOCK_HZ;
    }
#endif

#ifdef LTDC
    if (peripheral == LTDC)
    {
        return RCC_LTDC_CLOCK_HZ;
    }
#endif

#ifdef USB_OTG_FS
    if (peripheral == USB_OTG_FS)
    {
        return RCC_USB_CLOCK_HZ;
    }
#endif

#ifdef USB_OTG_HS
    if (peripheral == USB_OTG_HS)
    {
        return RCC_USB_CLOCK_HZ;
    }
#endif

    return 0U;
}

uint32_t RCC_GetSystemClockFrequency(void)
{
    return RCC_SYSTEM_CLOCK_HZ;
}

uint32_t RCC_GetCPUClockFrequency(void)
{
    return RCC_CPU_CLOCK_HZ;
}

uint32_t RCC_GetAHBClockFrequency(void)
{
    return RCC_AHB_CLOCK_HZ;
}

RCC_Result RCC_EnablePeripheralClock(const void *peripheral)
{
#define RCC_ENABLE_IF(PERIPHERAL, REGISTER, MASK) \
    do                                            \
    {                                             \
        if (peripheral == (const void *)(PERIPHERAL)) \
        {                                         \
            RCC->REGISTER |= (MASK);              \
            (void)RCC->REGISTER;                  \
            return RCC_RESULT_OK;                 \
        }                                         \
    } while (0)

    RCC_ENABLE_IF(GPIOA, AHB4ENR, RCC_AHB4ENR_GPIOAEN);
    RCC_ENABLE_IF(GPIOB, AHB4ENR, RCC_AHB4ENR_GPIOBEN);
    RCC_ENABLE_IF(GPIOC, AHB4ENR, RCC_AHB4ENR_GPIOCEN);
    RCC_ENABLE_IF(GPIOD, AHB4ENR, RCC_AHB4ENR_GPIODEN);
    RCC_ENABLE_IF(GPIOE, AHB4ENR, RCC_AHB4ENR_GPIOEEN);
    RCC_ENABLE_IF(GPIOF, AHB4ENR, RCC_AHB4ENR_GPIOFEN);
    RCC_ENABLE_IF(GPIOG, AHB4ENR, RCC_AHB4ENR_GPIOGEN);
    RCC_ENABLE_IF(GPIOH, AHB4ENR, RCC_AHB4ENR_GPIOHEN);
    RCC_ENABLE_IF(GPIOI, AHB4ENR, RCC_AHB4ENR_GPIOIEN);
    RCC_ENABLE_IF(GPIOJ, AHB4ENR, RCC_AHB4ENR_GPIOJEN);
    RCC_ENABLE_IF(GPIOK, AHB4ENR, RCC_AHB4ENR_GPIOKEN);

    RCC_ENABLE_IF(SPI1, APB2ENR, RCC_APB2ENR_SPI1EN);
    RCC_ENABLE_IF(SPI2, APB1LENR, RCC_APB1LENR_SPI2EN);
    RCC_ENABLE_IF(SPI3, APB1LENR, RCC_APB1LENR_SPI3EN);
    RCC_ENABLE_IF(SPI4, APB2ENR, RCC_APB2ENR_SPI4EN);
    RCC_ENABLE_IF(SPI5, APB2ENR, RCC_APB2ENR_SPI5EN);
    RCC_ENABLE_IF(SPI6, APB4ENR, RCC_APB4ENR_SPI6EN);

    RCC_ENABLE_IF(I2C1, APB1LENR, RCC_APB1LENR_I2C1EN);
    RCC_ENABLE_IF(I2C2, APB1LENR, RCC_APB1LENR_I2C2EN);
    RCC_ENABLE_IF(I2C3, APB1LENR, RCC_APB1LENR_I2C3EN);
    RCC_ENABLE_IF(I2C4, APB4ENR, RCC_APB4ENR_I2C4EN);

    RCC_ENABLE_IF(TIM1, APB2ENR, RCC_APB2ENR_TIM1EN);
    RCC_ENABLE_IF(TIM2, APB1LENR, RCC_APB1LENR_TIM2EN);
    RCC_ENABLE_IF(TIM3, APB1LENR, RCC_APB1LENR_TIM3EN);
    RCC_ENABLE_IF(TIM4, APB1LENR, RCC_APB1LENR_TIM4EN);
    RCC_ENABLE_IF(TIM5, APB1LENR, RCC_APB1LENR_TIM5EN);
    RCC_ENABLE_IF(TIM6, APB1LENR, RCC_APB1LENR_TIM6EN);
    RCC_ENABLE_IF(TIM7, APB1LENR, RCC_APB1LENR_TIM7EN);
    RCC_ENABLE_IF(TIM8, APB2ENR, RCC_APB2ENR_TIM8EN);

    RCC_ENABLE_IF(DMA1, AHB1ENR, RCC_AHB1ENR_DMA1EN);
    RCC_ENABLE_IF(DMA2, AHB1ENR, RCC_AHB1ENR_DMA2EN);

    RCC_ENABLE_IF(DAC1, APB1LENR, RCC_APB1LENR_DAC12EN);
    RCC_ENABLE_IF(LTDC, APB3ENR, RCC_APB3ENR_LTDCEN);

#undef RCC_ENABLE_IF

    return RCC_RESULT_UNSUPPORTED;
}

RCC_Result RCC_DisablePeripheralClock(const void *peripheral)
{
#define RCC_DISABLE_IF(PERIPHERAL, REGISTER, MASK) \
    do                                             \
    {                                              \
        if (peripheral == (const void *)(PERIPHERAL)) \
        {                                          \
            RCC->REGISTER &= ~(MASK);              \
            (void)RCC->REGISTER;                   \
            return RCC_RESULT_OK;                  \
        }                                          \
    } while (0)

    RCC_DISABLE_IF(GPIOA, AHB4ENR, RCC_AHB4ENR_GPIOAEN);
    RCC_DISABLE_IF(GPIOB, AHB4ENR, RCC_AHB4ENR_GPIOBEN);
    RCC_DISABLE_IF(GPIOC, AHB4ENR, RCC_AHB4ENR_GPIOCEN);
    RCC_DISABLE_IF(GPIOD, AHB4ENR, RCC_AHB4ENR_GPIODEN);
    RCC_DISABLE_IF(GPIOE, AHB4ENR, RCC_AHB4ENR_GPIOEEN);
    RCC_DISABLE_IF(GPIOF, AHB4ENR, RCC_AHB4ENR_GPIOFEN);
    RCC_DISABLE_IF(GPIOG, AHB4ENR, RCC_AHB4ENR_GPIOGEN);
    RCC_DISABLE_IF(GPIOH, AHB4ENR, RCC_AHB4ENR_GPIOHEN);
    RCC_DISABLE_IF(GPIOI, AHB4ENR, RCC_AHB4ENR_GPIOIEN);
    RCC_DISABLE_IF(GPIOJ, AHB4ENR, RCC_AHB4ENR_GPIOJEN);
    RCC_DISABLE_IF(GPIOK, AHB4ENR, RCC_AHB4ENR_GPIOKEN);

    RCC_DISABLE_IF(SPI1, APB2ENR, RCC_APB2ENR_SPI1EN);
    RCC_DISABLE_IF(SPI2, APB1LENR, RCC_APB1LENR_SPI2EN);
    RCC_DISABLE_IF(SPI3, APB1LENR, RCC_APB1LENR_SPI3EN);
    RCC_DISABLE_IF(SPI4, APB2ENR, RCC_APB2ENR_SPI4EN);
    RCC_DISABLE_IF(SPI5, APB2ENR, RCC_APB2ENR_SPI5EN);
    RCC_DISABLE_IF(SPI6, APB4ENR, RCC_APB4ENR_SPI6EN);

    RCC_DISABLE_IF(I2C1, APB1LENR, RCC_APB1LENR_I2C1EN);
    RCC_DISABLE_IF(I2C2, APB1LENR, RCC_APB1LENR_I2C2EN);
    RCC_DISABLE_IF(I2C3, APB1LENR, RCC_APB1LENR_I2C3EN);
    RCC_DISABLE_IF(I2C4, APB4ENR, RCC_APB4ENR_I2C4EN);

    RCC_DISABLE_IF(DMA1, AHB1ENR, RCC_AHB1ENR_DMA1EN);
    RCC_DISABLE_IF(DMA2, AHB1ENR, RCC_AHB1ENR_DMA2EN);

    RCC_DISABLE_IF(DAC1, APB1LENR, RCC_APB1LENR_DAC12EN);
    RCC_DISABLE_IF(LTDC, APB3ENR, RCC_APB3ENR_LTDCEN);

#undef RCC_DISABLE_IF

    return RCC_RESULT_UNSUPPORTED;
}

RCC_Result RCC_ResetPeripheral(const void *peripheral)
{
#define RCC_RESET_IF(PERIPHERAL, REGISTER, MASK) \
    do                                           \
    {                                            \
        if (peripheral == (const void *)(PERIPHERAL)) \
        {                                        \
            RCC->REGISTER |= (MASK);             \
            (void)RCC->REGISTER;                 \
            RCC->REGISTER &= ~(MASK);            \
            (void)RCC->REGISTER;                 \
            return RCC_RESULT_OK;                \
        }                                        \
    } while (0)

    RCC_RESET_IF(GPIOA, AHB4RSTR, RCC_AHB4RSTR_GPIOARST);
    RCC_RESET_IF(GPIOB, AHB4RSTR, RCC_AHB4RSTR_GPIOBRST);
    RCC_RESET_IF(GPIOC, AHB4RSTR, RCC_AHB4RSTR_GPIOCRST);
    RCC_RESET_IF(GPIOD, AHB4RSTR, RCC_AHB4RSTR_GPIODRST);
    RCC_RESET_IF(GPIOE, AHB4RSTR, RCC_AHB4RSTR_GPIOERST);
    RCC_RESET_IF(GPIOF, AHB4RSTR, RCC_AHB4RSTR_GPIOFRST);
    RCC_RESET_IF(GPIOG, AHB4RSTR, RCC_AHB4RSTR_GPIOGRST);
    RCC_RESET_IF(GPIOH, AHB4RSTR, RCC_AHB4RSTR_GPIOHRST);

    RCC_RESET_IF(SPI1, APB2RSTR, RCC_APB2RSTR_SPI1RST);
    RCC_RESET_IF(SPI2, APB1LRSTR, RCC_APB1LRSTR_SPI2RST);
    RCC_RESET_IF(SPI3, APB1LRSTR, RCC_APB1LRSTR_SPI3RST);
    RCC_RESET_IF(SPI4, APB2RSTR, RCC_APB2RSTR_SPI4RST);
    RCC_RESET_IF(SPI5, APB2RSTR, RCC_APB2RSTR_SPI5RST);
    RCC_RESET_IF(SPI6, APB4RSTR, RCC_APB4RSTR_SPI6RST);

    RCC_RESET_IF(I2C1, APB1LRSTR, RCC_APB1LRSTR_I2C1RST);
    RCC_RESET_IF(I2C2, APB1LRSTR, RCC_APB1LRSTR_I2C2RST);
    RCC_RESET_IF(I2C3, APB1LRSTR, RCC_APB1LRSTR_I2C3RST);
    RCC_RESET_IF(I2C4, APB4RSTR, RCC_APB4RSTR_I2C4RST);

    RCC_RESET_IF(DAC1, APB1LRSTR, RCC_APB1LRSTR_DAC12RST);
    RCC_RESET_IF(LTDC, APB3RSTR, RCC_APB3RSTR_LTDCRST);

#undef RCC_RESET_IF

    return RCC_RESULT_UNSUPPORTED;
}